//Описание

module.exports = {
    coding: { 
    
            name:'Back-end разработчик',
            descr: 'Back-end это программист, который отвечает за внутреннюю и вычислительную логику веб-сайта или веб-приложения, а также иного программного обеспечения и информационных систем. Бэкенд-разработчик создаёт компоненты и функции, которые доступны пользователю приложения или сайта через интерфейс. Проще говоря, бэкендеры — это программисты, которые разрабатывают всё то, что не видит и напрямую не трогает пользователь.',
            language: ' PHP, Python, Ruby, Java, Perl, Node JS (программные платформы), также Express (библиотеку взаимодействия платформы Node JS с сервером) и Mongo DB (БД для получения и хранения информации). В качестве дополнительных средств применяются фреймворки Symfony, Codeigniter, Yii, Zend Framework, Kohana',
            picture: 'https://roadmap.sh/roadmaps/backend.png',
            salary: 'Младший (Junior): 55 241 руб. Средний (Middle): 105 048 руб., Старший (Senior): 168 350 руб., Ведущий (Lead): 185 335 руб.'
            
        }
      

    }

