//Описание

module.exports = {
    coding: [
        {
            id: 1,
            name:'Back-end разработчик',
            descr: 'Back-end программист отвечает за внутреннюю и вычислительную логику веб-сайта или веб-приложения, а также иного программного обеспечения и информационных систем. Бэкенд-разработчик создаёт компоненты и функции, которые доступны пользователю приложения или сайта через интерфейс.',
            skills: 'PHP, Python, Ruby, Java, Perl, Node JS , также Express и Mongo DB',
            picture: 'https://roadmap.sh/roadmaps/backend.png',
            salary: 'Junior: 55 241 руб, Middle: 105 048 руб, Senior: 168 350 руб, Lead: 185 335 руб.'
        
           
    },
    {
        id: 2,
        name:'Front-end разработчик',
        descr: 'Front-end-разработчики несут ответственность за создание "клиентской" части в веб-приложениях, то есть они имеют дело со всем, с чем взаимодействует пользователь. Они определяют как все это будет работать с основной программно-аппаратной частью, которую готовит back-end разработчик.',
        skills: 'HTML5 и CSS3, JavaScript, SVG, DOM, Графические редакторы, Популярные CMS',
        picture: 'https://roadmap.sh/roadmaps/frontend.png',
        salary:  'Junior: 52000 руб, Middle: 96 643 руб, Senior: 145 334 руб, Lead: 172 641 руб.'
    },
    {
        id: 3,
        name:'DevOps-инженер',
        descr: 'DevOps-инженер занимается внедрением методологии DevOps. Он синхронизирует все этапы создания программного продукта: от написания кода до тестирования и выпуска приложения. DevOps-инженер отвечает за любую автоматизацию задач, связанных с настройкой и развертыванием приложений',
        skills: 'Oracle Database, Microsoft SQL Server, MySQL, SQLite, PostgreSQL',
        picture: 'https://www.freecodecamp.org/news/content/images/2019/06/2019-roadmap-3-1.png',
        salary:  'Junior: 67000 руб, Middle: 103 643 руб, Senior: 185 334 руб, Lead: 200 117 руб.'
    },
    {
        id: 4,
        name:'IOS-разработчик',
        descr: 'Разработчик iOS — это специалист, который создает мобильные iOS-приложения. Эти специалисты являются самыми доходными на мобильном рынке. А с появлением языка Swift разработка для устройств Apple стала максимально простой и удобной. В ближайшем будущем этот новый язык программирования может полностью заменить Objective-C. Знание Swift является большим преимуществом для программистов Apple.',
        skills: 'CSS и HTML, среды разработки Cocoa/Xcode, Objective-C/С++. Знание Android, iOS SDK, шаблоны проектирования, библиотеки и архитектуру iOS, Android.',
        picture: 'https://i.pinimg.com/originals/b9/03/a6/b903a645c6dbafda46d588853c960bd4.png',
        salary:  'Junior: 61340 руб, Middle: 86 235 руб, Senior: 164 334 руб, Lead: 197 131 руб.'
    }
],
    analytics:[
        {
            id:5, 
            name:'Аналитик данных',
            descr: 'Аналитик данных – это универсальный специалист, который обладает знаниями в математике, статистике, информатике, компьютерных науках, бизнесе и экономике. Он занимается проведением описательного (дескриптивного) анализа данных и их интерпретацией. Работа аналитика заключается в анализе разнообразных данных, как правило, цифровых, на основании которых можно делать определённые выводы.',
            skills: 'R, Python, SQL,  Power BI, QlikView, Статистика, Теория вероятностей, дискретная математика, Системный анализ',
            picture: 'https://i.pinimg.com/originals/72/39/95/723995eb41f5dfec8f5a3c1ee5951bc4.jpg',
            salary:  'Junior: 42514 руб, Middle: 63 362 руб, Senior: 94 824 руб.'
    }

    ],
    pr: [
        {
            id: 6,
            name:'SEO-специалист',
            descr: 'От работы SEO-специалиста зависит, попадёт ли сайт на первые позиции в выдаче Google и «Яндекса» или останется на десятой странице, куда никто не заходит. Сеошник настраивает страницы под требования поисковых систем, составляет список ключевых слов и выражений, по которым пользователи могли бы перейти на сайт, анализирует конкурентов.',
            skills: 'СSS3, HTML5, Использование препроцессоров LESS, инструменты SEO-оптимизации, Google Analytics и Яндекс.Метрика',
            picture: 'https://sendiancreations.com/wp-content/uploads/2018/08/seo-marketing-services.jpg',
            salary:  'Junior: 38 000 руб, Middle: 52 000 руб, Senior: 78 000 руб.'

        },
        {
            id: 7,
            name:'SMM-специалист',
            descr: 'SMM-специалисты - это люди, которые придумывают идеи постов, пишут тексты и создают графику, общаются с подписчиками, отвечают на комментарии, привлекают в группы новых участников, монетизируют сообщества. Они также определяют, в каких сетях должен присутствовать бренд и в каким образом. Например, что лучше сделать – раскрутить паблик во ВКонтакте или аккаунт в Инстаграм.',
            skills: 'Общие знания в сфере маркетинга и рекламы, Instagram, YouTube, Facebook, VK',
            picture: 'https://sun9-33.userapi.com/c845323/v845323708/1ae1c9/UPu6HGD5x1A.jpg',
            salary:  'Junior: 34 514 руб, Middle: 53 257 руб, Senior: 75 321 руб.'
        },
        {
            id: 8,
            name:'Контент-менеджер',
            descr: 'Управляющий специалист по созданию, распространению и курированию содержимого сайтов, редактор сайтов. В обязанности контент-менеджера входит наполнение сайта текстовой, графической и другими видами информации, полезной и удобной для восприятия выбранной целевой группой (контентом). Контент-менеджер может использовать в работе гайдлайн для систематизации и качественного отображения всего графического и текстового контента на веб-ресурсе.',
            skills: 'HTML, CSS, Высокая грамотность, Графические редакторы, Google Analytics, Яндекс-Метрика',
            picture: 'https://daniellatto.co.uk/wp-content/uploads/2017/02/Podcast-99.jpg',
            salary:  'Junior: 32 351 руб, Middle: 51 362 руб, Senior: 69 824 руб'

        }

    ],

    design: [
        {

          id: 9,
          name:'UI-дизайнер',
          descr: 'Это человек, обладающий художественным вкусом и знаниями интернет-технологий, который создает Web-страницы и объединяет их в Web-сайты. Главная задача web-дизайнера — оформить интернет-проект так, чтобы как можно больше пользователей им заинтересовалось. Кроме сайтов, веб-дизайнеры разрабатывают баннеры, интернет-открытки, электронные презентации.',
          skills: 'СSS3, HTML5, Графические редакторы: Adobe Photoshop, Adobe Illustrator, Figma, Corel Draw, знание основ UX/UI',
          picture: 'https://camo.githubusercontent.com/e003c3de8bc4e4f230f074bca28dcb5eaf8cc278/687474703a2f2f692e696d6775722e636f6d2f6e476742315a462e706e67',
          salary:  'Junior: 47 879 руб, Middle: 55 000 руб, Senior: 71 354 руб,  Lead: 87 356 руб'

        },
        {
          id: 10,
          name:'3D-аниматор',
          descr: '3D-аниматор — профессионал в области трехмерной графики, который настраивает компьютерные персонажи для игровой анимации, обеспечивает движение рисованных моделей и объектов. Главной задачей 3D-аниматора во время создания фильма является то, что в нужный момент он должен сделать нарисованных персонажей живыми, заставить их двигаться, придать им свой особенный характер, наделить эмоциями.',
          skills: 'Unreal Engine, MVN Animate, 3D Max, Blender,  Unity3D, Графические редакторы, Adobe Photoshop, Adobe Illustrator, Figma, Corel Draw',
          picture: 'https://www.awwwards.com/awards/images/2014/04/web-animation-libraries-B.jpg',
          salary:  'Junior: 64 257 руб, Middle: 85 040 руб, Senior: 96 384 руб,  Lead: 157 235 руб'
            

        },

        {
            id: 11,
            name:'UX-дизайнер',
            descr: 'Это специалист, который в первую очередь озабочен тем, как продукт взаимодействует с пользователем. UX дизайнеры исследуют различные подходы к решению конкретной проблемы пользователя. Основная задача UX дизайнера — убедиться, что продукт логически перетекает от одного шага к другому.',
            skills: 'Adobe Photoshop, Adobe illustrator, Axure, MS Visio, MS Word, Adobe InDesign, Sparx EA, JS, HTML+CSS',
            picture: 'https://camo.githubusercontent.com/463a4b38f87261eb9d0f92b18577190c56e3baf6/687474703a2f2f692e696d6775722e636f6d2f64754b427a4e4c2e706e67',
            salary:  'Junior: 74 351 руб, Middle: 96 235 руб, Senior: 125 521 руб,  Lead: 185 357 руб'
  
          }

    ]

    }

